
/*
 Фасад позволяет скрыть более сложную систему, библиотеку или фреймворк за более простым интерфейсом.
 Этот интерфейс предоставляет усеченный функционал для решения конкретной задачи.
 
 Например, для получения результата нужно создать некоторое количество объектов, правильно настроить связи между ними и вызвать их методы в определенной последовательности. В итоге, логика реализации приложения тесно переплетается с особенностями реализации этих объектов. Появляеется сильная связанность. Введя дополнительный класс (фасад) с упрощенным интерфейсом, который позволяет достичь тот же самый результат, но обратившись только к одному методу решает нашу проблему.
 */
